infoserver/build/xmls/getheatstate.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope 
	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
	xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" 
	xmlns:tns="urn:ActionWebService" 
	xmlns:types="urn:ActionWebService/encodedTypes" 
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
	xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	
	<soap:Body soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
		<tns:GetHeatState>
			<heat_id xsi:type="xsd:int">heatId</heat_id>
		</tns:GetHeatState>
	</soap:Body>
</soap:Envelope>


